Repository: Open-Core-Finance/income-expense-budget-plan
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Income Expense Budget Planing
vi: Kế hoặch hạn mức thu chi

# navReport
source: Report
vi: Báo cáo

# navHistory
source: History
vi: Lịch sử

# navAccount
source: Account
vi: Tài khoản

# navMore
source: More
vi: Thêm

# navAccountCategory
source: Account category
vi: Nhóm tài khoản

# navTransactionCategory
source: Transaction category
vi: Hạng mục giao dịch

# menuAccountCategory
source: Account category
vi: Nhóm tài khoản

# menuIncomeCategory
source: Income category
vi: Hạng mục thu nhập

# menuExpenseCategory
source: Expense category
vi: Hạng mục chi

# titleAccount
source: Accounts
vi: Danh sách tài khoản

# titleAddAccountCategory
source: Add account category
vi: Thêm nhóm tài khoản

# titleAddIncomeCategory
source: Add income category
vi: Thêm hạng mục thu nhập

# titleAddExpenseCategory
source: Add expense category
vi: Thêm hạng mục chi

# titleAddTransactionCategory
source: Add transaction category
vi: Thêm hạng mục giao dịch

# titleAddAccount
source: Add account
vi: Thêm tài khoản

# titleError
source: Error
vi: Lỗi

# titleAddTransaction
source: Add transaction
vi: Thêm giao dịch

# settingsDarkMode
source: Brightness
vi: Độ sáng

# settingsDarkModeAuto
source: System
vi: Hệ thống

# accountCategoryName
source: Category name
vi: Tên nhóm

# accountCategoryActionAdd
source: Add
vi: Thêm

# accountCategoryActionSave
source: Save
vi: Lưu

# accountCategoryActionSaveAddMore
source: Save/Add More
vi: Lưu/Thêm tiếp

# accountCategoryActionSelectIcon
source: Select icon
vi: Chọn icon

# accountCategoryValidateNameExisted
source: Category name already existed!
vi: Tên nhóm đã tồn tại!

# accountCategoryValidateNameEmpty
source: Please input category name!
vi: Xin hãy nhập tên nhóm!

# accountCategoryDeleteDialogTitle
source: Confirm to delete category "{categoryName}"
vi: Xác nhận xoá nhóm "{categoryName}"

# accountCategoryDeleteConfirm
source: Are you sure to delete category "{categoryName}"?
vi: Bạn có chắc muốn xoá nhóm "{categoryName}" không?

# accountCategoryDeleteError
source: Deleting category "{categoryName}" fail!
vi: Xoá nhóm "{categoryName}" thất bại!

# accountCategoryDeleteSuccess
source: Deleting category "{categoryName}" success!
vi: Xoá nhóm "{categoryName}" thành công!

# accountCategoryTurnOnLocalizeNames
source: Turn on multi-language support
vi: Bật hổ trợ đa ngôn ngữ

# transactionCategoryName
source: Category name
vi: Tên hạng mục

# transactionCategoryParent
source: Parent category
vi: Hạng mục cha

# transactionCategoryActionSave
source: Save
vi: Lưu

# transactionCategoryActionSaveAddMore
source: Save/Add More
vi: Lưu/Thêm tiếp

# transactionCategoryActionSelectIcon
source: Select icon
vi: Chọn icon

# transactionCategoryValidateNameExisted
source: Category name already existed!
vi: Tên hạng mục đã tồn tại!

# transactionCategoryValidateNameEmpty
source: Please input category name!
vi: Xin hãy nhập tên hạng mục!

# transactionCategoryDeleteDialogTitle
source: Confirm to delete category "{categoryName}"
vi: Xác nhận xoá hạng mục "{categoryName}"

# transactionCategoryDeleteConfirm
source: Are you sure to delete category "{categoryName}"?
vi: Bạn có chắc muốn xoá hạng mục "{categoryName}" không?

# transactionCategoryDeleteError
source: Deleting category "{categoryName}" fail!
vi: Xoá hạng mục "{categoryName}" thất bại!

# transactionCategoryDeleteSuccess
source: Deleting category "{categoryName}" success!
vi: Xoá hạng mục "{categoryName}" thành công!

# transactionCategoryTurnOnLocalizeNames
source: Turn on multi-language support
vi: Bật hổ trợ đa ngôn ngữ

# transactionCategoryDragToInvalidTarget
source: Only allow drag and drop between 2 categories with the same parent! If you want to change parent please edit the category!
vi: Chỉ hổ trợ kéo thả giữa 2 hạng mục có cùng cha! Nếu muốn thay đổi hạng mục cha xin hãy chỉnh sửa hạng mục!

# actionConfirm
source: Confirm
vi: Xác nhận

# actionClose
source: Close
vi: Đóng

# actionOk
source: OK
vi: Đồng ý

# accountActionSelectIcon
source: Select icon
vi: Chọn icon

# accountValidateNameEmpty
source: Please input account name!
vi: Xin hãy nhập tên tài khoản!

# accountValidateNameExisted
source: Account name already existed!
vi: Tên tài khoản đã tồn tại!

# accountActionSaveAddMore
source: Save/Add More
vi: Lưu/Thêm tiếp

# accountActionSave
source: Save
vi: Lưu

source: Account name
vi: Tên tài khoản

# accountTurnOnLocalizeNames
source: Turn on multi-language support
vi: Bật hổ trợ đa ngôn ngữ

source: Account type
vi: Loại tài khoản

# accountType_bankCasa
source: Bank Account
vi: Ngân hàng

# accountType_loan
source: Loan
vi: Vay

# accountType_eWallet
source: E-Wallet
vi: Ví điện tử

# accountType_creditCard
source: Credit Card
vi: Thẻ tín dụng

# accountType_payLaterAccount
source: Pay Later Account
vi: Tài khoản trả sau

# accountDescription
source: Description
vi: Mô tả

# accountAvailableAmount
source: Available amount
vi: Số dư

# accountLoanAmount
source: Loan amount
vi: Số tiền vay

# accountDepositAmount
source: Deposit amount
vi: Số tiền gửi

# accountCreditLimit
source: Credit limit
vi: Hạn mức tín dụng

# accountPaymentLimit
source: Payment limit
vi: Hạn mức thanh toán

# accountCurrencySelect
source: Account currency
vi: Tiền tệ

# currencyDialogTitleSelectDefault
source: Select default currency
vi: Chọn đơn vị tiền mặt định

# currencyDialogEmptySelectionError
source: Please select 1 currency as default!
vi: Xin hãy chọn 1 đợn vị tiền làm tiền tệ mặt định!

# accountCategorySelect
source: Category select
vi: Chọn nhóm

# accountDeleteDialogTitle
source: Confirm to delete asset "{assetName}"
vi: Xác nhận xoá tài khoản "{assetName}"

# accountDeleteConfirm
source: Are you sure to delete asset "{assetName}"?
vi: Bạn có chắc muốn xoá tài khoản "{assetName}" không?

# accountDeleteError
source: Deleting asset "{assetName}" fail!
vi: Xoá tài khoản "{assetName}" thất bại!

# accountDeleteSuccess
source: Deleting asset "{assetName}" success!
vi: Xoá tài khoản "{assetName}" thành công!

# accountCategoryEmpty
source: There's no account in this category
vi: Không có tài khoảng nào trong nhóm này

source: No data
vi: Không có dữ liệu

# transactionActionSaveAddMore
source: Save/Add More
vi: Lưu/Thêm tiếp

# transactionAmount
source: Amount
vi: Giá trị

# transactionCurrency
source: Currency
vi: Tiền tệ

# transactionDescription
source: Note
vi: Diễn giải

# transactionTypeIncome
source: Income
vi: Thu tiền

# transactionTypeExpense
source: Expense
vi: Chi tiền

# transactionTypeTransfer
source: Transfer
vi: Chuyển khoản

# transactionTypeLend
source: Lend
vi: Cho vay

# transactionTypeBorrowing
source: Borrowing
vi: Vay tiền

# transactionTypeAdjustment
source: Adjustment
vi: Điều chỉnh số dư

# transactionTypeShareBill
source: Share bill
vi: Đơn chia tiền

# transactionTypeShareBillReturn
source: Share bill return
vi: Trả tiền cho đơn

source: Transaction type
vi: Loại giao dịch

source: Transaction date
vi: Ngày giao dịch

source: Transaction time
vi: Giờ giao dịch

source: Transaction category
vi: Hạn mục giao dịch

# transactionAccount
source: Account
vi: Tài khoản

# transactionDeleteDialogTitle
source: Confirm to delete transaction
vi: Xác nhận xóa giao dịch

# transactionDeleteConfirm
source: Are you sure to delete transaction?
vi: Bạn có chắc muốn xóa giao dịch?

# transactionDeleteError
source: Deleting transaction fail!
vi: Xóa giao dịch thất bại!

# transactionDeleteSuccess
source: Deleting transaction success!
vi: Xóa giao dịch thành công!

# transactionUpdateError
source: Updating transaction fail!
vi: Cập nhật giao dịch thất bại!

source: Date
vi: Ngày

source: Time
vi: Giờ

# selectDateEmpty
source: Please select a date
vi: Xin hãy chọn ngày tháng

# selectTimeEmpty
source: Please select a time
vi: Xin hãy chọn thời gian

# transferFromAccount
source: From account
vi: Từ tài khoản

# transferToAccount
source: To account
vi: Đến tài khoản

source: Lending account
vi: Tài khoản cho vay

# borrowingAccount
source: Borrow account
vi: Tài khoản nhận

# sharedBillMySplit
source: My split
vi: Phần của bản thân

# adjustmentNewAmount
source: New amount
vi: Giá trị mới

# adjustmentCurrentAmount
source: Current amount
vi: Giá trị hiện tại

# sharedBillReturnForBill
source: Return for bill
vi: Tiền trả cho hoá đơn
